Repository: sodo13/BH-gui
Catalog: lib/python/Plugins/Extensions/GreekNetRadio/po/*/LC_MESSAGES/lang.po
Languages: el

source: Favorites
el: Αγαπημένα

source: Greek Fm Stations
el: Ελληνικοί Fm Σταθμοί

source: Greek Web Stations
el: Ελληνικοί Web Σταθμοί

source: International Stations
el: Διεθνείς Σταθμοί

source: Update Stations
el: Αναβάθμιση σταθμών

source: About %s
el: Περί %s

source: Confirm your selection, or exit
el: Επιβεβαιώσετε την επιλογή σας, Exit να εξέλθετε!

source: Install sources
el: Εγκατάσταση πηγών

source: Exit
el: Έξοδος

source: Delete
el: Διαγραφή

source: Press OK to Play, Green to delete, or EXIT
el: Πιέστε ΟΚ για αναπαραγωγή, πράσινο για διαγραφή, Exit για έξοδο

source: Press UP or DOWN to change stations , EXIT to quit
el: Πιέστε πάνω η κάτω βέλος για αλλαγή σταθμού, Exit για έξοδο

source: Press OK to Play, or button yellow add to favorites
el: Πιέστε ΟΚ για αναπαραγωγή, ή το κίτρινο πλήκτρο για προσθήκη στα αγαπημένα

source: Saved to Favorites
el: Αποθήκευση στα αγαπημένα

source: Listen to your greek music
el: Ελληνικά Ραδιόφωνα
